# language: ru
Функция: Home34

  Сценарий: первый сценарий
    * инициализация класса калькулятора
    * умножаю 10 на 10
    * результат равен 100

  Сценарий: первый сценарий
    * инициализация класса калькулятора
    * умножаю 2 на 10
    * результат равен 20

  Сценарий: первый сценарий
    * инициализация класса калькулятора
    * умножаю -2 на 10
    * результат равен -20

  Сценарий: первый сценарий
    * инициализация класса калькулятора
    * умножаю 0 на 10
    * результат равен 0

  Сценарий: второй сценарий
    * инициализация класса калькулятора
    * умножаю 10 на 10
    * результат не равен 101